wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_cla.h
/*!
    \file    gd32g5x3_cla.h
    \brief   definitions for the CLA
    
    \version 2026-02-04, V1.5.0, firmware for GD32G5x3
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32G5X3_CLA_H
#define GD32G5X3_CLA_H

#include "gd32g5x3.h"

/*CLA definitions */
#define CLA                                CLA_BASE

/* registers definitions */
#define CLA_GCTL                           REG32((CLA) + 0x00000000U)                              /*!< CLA global control register */
#define CLA_INTE                           REG32((CLA) + 0x00000004U)                              /*!< CLA interrupt flag enable register */
#define CLA_INTF                           REG32((CLA) + 0x00000008U)                              /*!< CLA interrupt flag register */
#define CLA_STAT                           REG32((CLA) + 0x0000000CU)                              /*!< CLA status register */
#define CLA_SIGS(CLAx)                     REG32((CLA) + 0x00000010U + ((CLAx) * 0x0000000CU))     /*!< CLA multiplexer selection register */
#define CLA_LCUCTL(CLAx)                   REG32((CLA) + 0x00000014U + ((CLAx) * 0x0000000CU))     /*!< CLA LCU control register */
#define CLA_CTL(CLAx)                      REG32((CLA) + 0x00000018U + ((CLAx) * 0x0000000CU))     /*!< CLA control register */

/* bits definitions */
/* CLA_GCTL */
#define CLA_GCTL_CLA0EN                    BIT(0)                           /*!< CLA0 unit enable */
#define CLA_GCTL_CLA1EN                    BIT(1)                           /*!< CLA1 unit enable */
#define CLA_GCTL_CLA2EN                    BIT(2)                           /*!< CLA2 unit enable */
#define CLA_GCTL_CLA3EN                    BIT(3)                           /*!< CLA3 unit enable */

/* CLA_INTE */
#define CLA_INTE_CLA0NIE                   BIT(0)                           /*!< CLA0 uint falling edge interrupt enable */
#define CLA_INTE_CLA0PIE                   BIT(1)                           /*!< CLA0 uint rising edge interrupt enable */
#define CLA_INTE_CLA1NIE                   BIT(2)                           /*!< CLA1 uint falling edge interrupt enable */
#define CLA_INTE_CLA1PIE                   BIT(3)                           /*!< CLA1 uint rising edge interrupt enable */
#define CLA_INTE_CLA2NIE                   BIT(4)                           /*!< CLA2 uint falling edge interrupt enable */
#define CLA_INTE_CLA2PIE                   BIT(5)                           /*!< CLA2 uint rising edge interrupt enable */
#define CLA_INTE_CLA3NIE                   BIT(6)                           /*!< CLA3 uint falling edge interrupt enable */
#define CLA_INTE_CLA3PIE                   BIT(7)                           /*!< CLA3 uint rising edge interrupt enable */

/* CLA_INTF */
#define CLA_INTF_CLA0NF                    BIT(0)                           /*!< CLA0 uint falling edge flag */
#define CLA_INTF_CLA0PF                    BIT(1)                           /*!< CLA0 uint rising edge flag */
#define CLA_INTF_CLA1NF                    BIT(2)                           /*!< CLA1 uint falling edge flag */
#define CLA_INTF_CLA1PF                    BIT(3)                           /*!< CLA1 uint rising edge flag */
#define CLA_INTF_CLA2NF                    BIT(4)                           /*!< CLA2 uint falling edge flag */
#define CLA_INTF_CLA2PF                    BIT(5)                           /*!< CLA2 uint rising edge flag */
#define CLA_INTF_CLA3NF                    BIT(6)                           /*!< CLA3 uint falling edge flag */
#define CLA_INTF_CLA3PF                    BIT(7)                           /*!< CLA3 uint rising edge flag */

/* CLA_STAT */
#define CLA_STAT_CLA0OUT                   BIT(0)                           /*!< CLA0 unit output state */
#define CLA_STAT_CLA1OUT                   BIT(1)                           /*!< CLA1 unit output state */
#define CLA_STAT_CLA2OUT                   BIT(2)                           /*!< CLA2 unit output state */
#define CLA_STAT_CLA3OUT                   BIT(3)                           /*!< CLA3 unit output state */

/* CLAx_SIGS */
#define CLA_SIGS_SIGS1                     BITS(0,3)                        /*!< multiplexer 1 input selection */
#define CLA_SIGS_SIGS0                     BITS(4,7)                        /*!< multiplexer 0 input selection */

/* CLAx_LCUCTL */
#define CLA_LCU                            BITS(0,7)                        /*!< LCU control */

/* CLAx_CTL */
#define CLA_CTL_CSEL                       BITS(0,1)                        /*!< clock selection */
#define CLA_CTL_CPOL                       BIT(2)                           /*!< clock polarity*/
#define CLA_CTL_FFRST                      BIT(3)                           /*!< Flip- flop output reset */
#define CLA_CTL_OEN                        BIT(6)                           /*!< output enable */
#define CLA_CTL_OSEL                       BIT(7)                           /*!< output selection */

/* constants definitions */
/* CLA flags */
typedef enum
{
    /* flags in INTF register */
    CLA_FLAG_CLA0NF,                                                        /*!< CLA0 unit falling edge flag */
    CLA_FLAG_CLA0PF,                                                        /*!< CLA0 unit rising edge flag */
    CLA_FLAG_CLA1NF,                                                        /*!< CLA1 unit falling edge flag */
    CLA_FLAG_CLA1PF,                                                        /*!< CLA1 unit rising edge flag */
    CLA_FLAG_CLA2NF,                                                        /*!< CLA2 unit falling edge flag */
    CLA_FLAG_CLA2PF,                                                        /*!< CLA2 unit rising edge flag */
    CLA_FLAG_CLA3NF,                                                        /*!< CLA3 unit falling edge flag */
    CLA_FLAG_CLA3PF,                                                        /*!< CLA3 unit rising edge flag */
}cla_flag_enum;

/* CLA interrupt flags */
typedef enum
{
    /* interrupt flags in INTF register */
    CLA_INT_FLAG_CLA0NF,                                                    /*!< CLA0 unit falling edge interrupt flag */
    CLA_INT_FLAG_CLA0PF,                                                    /*!< CLA0 unit rising edge interrupt flag */
    CLA_INT_FLAG_CLA1NF,                                                    /*!< CLA1 unit falling edge interrupt flag */
    CLA_INT_FLAG_CLA1PF,                                                    /*!< CLA1 unit rising edge interrupt flag */
    CLA_INT_FLAG_CLA2NF,                                                    /*!< CLA2 unit falling edge interrupt flag */
    CLA_INT_FLAG_CLA2PF,                                                    /*!< CLA2 unit rising edge interrupt flag */
    CLA_INT_FLAG_CLA3NF,                                                    /*!< CLA3 unit falling edge interrupt flag */
    CLA_INT_FLAG_CLA3PF,                                                    /*!< CLA3 unit rising edge interrupt flag */
}cla_interrupt_flag_enum;

/* CLA units */
typedef enum
{
    CLA0,
    CLA1,
    CLA2,
    CLA3,
}cla_enum;

/* CLA multiplexer */
typedef enum
{
    SIGS0,
    SIGS1
}cla_sigs_enum;

/* output state of CLAx unit */
typedef enum
{
    CLA_OUTPUT_LOW,
    CLA_OUTPUT_HIGH
}cla_outputstatus_enum;

/* falling edge interrupt enable */
#define CLA0NIE                          CLA_INTE_CLA0NIE                   /*!< enable CLA0 unit falling edge interrupt */
#define CLA1NIE                          CLA_INTE_CLA1NIE                   /*!< enable CLA1 unit falling edge interrupt */
#define CLA2NIE                          CLA_INTE_CLA2NIE                   /*!< enable CLA2 unit falling edge interrupt */
#define CLA3NIE                          CLA_INTE_CLA3NIE                   /*!< enable CLA3 unit falling edge interrupt */

/* falling edge interrupt disable */
#define CLA0NI_DISABLE                   CLA_INTE_CLA0NIE                   /*!< disable CLA0 unit falling edge interrupt */
#define CLA1NI_DISABLE                   CLA_INTE_CLA1NIE                   /*!< disable CLA1 unit falling edge interrupt */
#define CLA2NI_DISABLE                   CLA_INTE_CLA2NIE                   /*!< disable CLA2 unit falling edge interrupt */
#define CLA3NI_DISABLE                   CLA_INTE_CLA3NIE                   /*!< disable CLA3 unit falling edge interrupt */

/* falling edge interrupt enable */
#define CLA0PIE                          CLA_INTE_CLA0PIE                   /*!< enable CLA0 unit  rising edge interrupt */
#define CLA1PIE                          CLA_INTE_CLA1PIE                   /*!< enable CLA1 unit  rising edge interrupt */
#define CLA2PIE                          CLA_INTE_CLA2PIE                   /*!< enable CLA2 unit  rising edge interrupt */
#define CLA3PIE                          CLA_INTE_CLA3PIE                   /*!< enable CLA3 unit  rising edge interrupt */

/* rising edge interrupt disable */
#define CLA0PI_DISABLE                   CLA_INTE_CLAOPIE                   /*!< disable CLA0 unit  rising edge interrupt */
#define CLA1PI_DISABLE                   CLA_INTE_CLA1PIE                   /*!< disable CLA1 unit  rising edge interrupt */
#define CLA2PI_DISABLE                   CLA_INTE_CLA2PIE                   /*!< disable CLA2 unit  rising edge interrupt */
#define CLA3PI_DISABLE                   CLA_INTE_CLA3PIE                   /*!< disable CLA3 unit  rising edge interrupt */

/* SIGS0 input selection */
#define CLA_SIGS0(regval)                (BITS(4,7) & ((uint32_t)(regval) << 4U))
#define CLA0SIGS0_CLA0_ASYNC_OUT         CLA_SIGS0(0)                       /*!< the input of CLA0SIGS0 is CLA0_ASYNC_OUT */
#define CLA1SIGS0_CLA0_ASYNC_OUT         CLA_SIGS0(0)                       /*!< the input of CLA1SIGS0 is CLA0_ASYNC_OUT */
#define CLA2SIGS0_CLA0_ASYNC_OUT         CLA_SIGS0(0)                       /*!< the input of CLA2SIGS0 is CLA0_ASYNC_OUT */
#define CLA3SIGS0_CLA0_ASYNC_OUT         CLA_SIGS0(0)                       /*!< the input of CLA3SIGS0 is CLA0_ASYNC_OUT */

