wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_cla.h
#define CLA0SIGS0_CLA1_ASYNC_OUT         CLA_SIGS0(1)                       /*!< the input of CLA0SIGS0 is CLA1_ASYNC_OUT */
#define CLA1SIGS0_CLA1_ASYNC_OUT         CLA_SIGS0(1)                       /*!< the input of CLA1SIGS0 is CLA1_ASYNC_OUT */
#define CLA2SIGS0_CLA1_ASYNC_OUT         CLA_SIGS0(1)                       /*!< the input of CLA2SIGS0 is CLA1_ASYNC_OUT */
#define CLA3SIGS0_CLA1_ASYNC_OUT         CLA_SIGS0(1)                       /*!< the input of CLA3SIGS0 is CLA1_ASYNC_OUT */

#define CLA0SIGS0_CLA2_ASYNC_OUT         CLA_SIGS0(2)                       /*!< the input of CLA0SIGS0 is CLA2_ASYNC_OUT */
#define CLA1SIGS0_CLA2_ASYNC_OUT         CLA_SIGS0(2)                       /*!< the input of CLA1SIGS0 is CLA2_ASYNC_OUT */
#define CLA2SIGS0_CLA2_ASYNC_OUT         CLA_SIGS0(2)                       /*!< the input of CLA2SIGS0 is CLA2_ASYNC_OUT */
#define CLA3SIGS0_CLA2_ASYNC_OUT         CLA_SIGS0(2)                       /*!< the input of CLA3SIGS0 is CLA2_ASYNC_OUT */

#define CLA0SIGS0_CLA3_ASYNC_OUT         CLA_SIGS0(3)                       /*!< the input of CLA0SIGS0 is CLA3_ASYNC_OUT */
#define CLA1SIGS0_CLA3_ASYNC_OUT         CLA_SIGS0(3)                       /*!< the input of CLA1SIGS0 is CLA3_ASYNC_OUT */
#define CLA2SIGS0_CLA3_ASYNC_OUT         CLA_SIGS0(3)                       /*!< the input of CLA2SIGS0 is CLA3_ASYNC_OUT */
#define CLA3SIGS0_CLA3_ASYNC_OUT         CLA_SIGS0(3)                       /*!< the input of CLA3SIGS0 is CLA3_ASYNC_OUT */

#define CLA0SIGS0_TRIGSEL_CLA_IN7        CLA_SIGS0(4)                       /*!< the input of CLA0SIGS0 is TRIGSEL_CLA_IN7 */
#define CLA1SIGS0_TRIGSEL_CLA_IN8        CLA_SIGS0(4)                       /*!< the input of CLA1SIGS0 is TRIGSEL_CLA_IN8 */
#define CLA2SIGS0_TRIGSEL_CLA_IN9        CLA_SIGS0(4)                       /*!< the input of CLA2SIGS0 is TRIGSEL_CLA_IN9 */
#define CLA3SIGS0_TRIGSEL_CLA_IN10       CLA_SIGS0(4)                       /*!< the input of CLA3SIGS0 is TRIGSEL_CLA_IN10 */

#define CLA0SIGS0_TRIGSEL_CLA_IN0        CLA_SIGS0(5)                       /*!< the input of CLA0SIGS0 is TRIGSEL_CLA_IN0 */
#define CLA1SIGS0_TRIGSEL_CLA_IN0        CLA_SIGS0(5)                       /*!< the input of CLA1SIGS0 is TRIGSEL_CLA_IN0 */
#define CLA2SIGS0_TRIGSEL_CLA_IN1        CLA_SIGS0(5)                       /*!< the input of CLA2SIGS0 is TRIGSEL_CLA_IN1 */
#define CLA3SIGS0_TRIGSEL_CLA_IN2        CLA_SIGS0(5)                       /*!< the input of CLA3SIGS0 is TRIGSEL_CLA_IN2 */

#define CLA0SIGS0_TRIGSEL_CLA_IN1        CLA_SIGS0(6)                       /*!< the input of CLA0SIGS0 is TRIGSEL_CLA_IN1 */
#define CLA1SIGS0_TRIGSEL_CLA_IN3        CLA_SIGS0(6)                       /*!< the input of CLA1SIGS0 is TRIGSEL_CLA_IN3 */
#define CLA2SIGS0_TRIGSEL_CLA_IN3        CLA_SIGS0(6)                       /*!< the input of CLA2SIGS0 is TRIGSEL_CLA_IN3 */
#define CLA3SIGS0_TRIGSEL_CLA_IN4        CLA_SIGS0(6)                       /*!< the input of CLA3SIGS0 is TRIGSEL_CLA_IN4 */

#define CLA0SIGS0_TRIGSEL_CLA_IN2        CLA_SIGS0(7)                       /*!< the input of CLA0SIGS0 is TRIGSEL_CLA_IN2 */
#define CLA1SIGS0_TRIGSEL_CLA_IN4        CLA_SIGS0(7)                       /*!< the input of CLA1SIGS0 is TRIGSEL_CLA_IN4 */
#define CLA2SIGS0_TRIGSEL_CLA_IN5        CLA_SIGS0(7)                       /*!< the input of CLA2SIGS0 is TRIGSEL_CLA_IN5 */
#define CLA3SIGS0_TRIGSEL_CLA_IN5        CLA_SIGS0(7)                       /*!< the input of CLA3SIGS0 is TRIGSEL_CLA_IN5 */

#define CLA0SIGS0_CLAIN0                 CLA_SIGS0(8)                       /*!< the input of CLA0SIGS0 is CLAIN0(PA15) */
#define CLA1SIGS0_CLAIN4                 CLA_SIGS0(8)                       /*!< the input of CLA1SIGS0 is CLAIN4(PB6) */
#define CLA2SIGS0_CLAIN0                 CLA_SIGS0(8)                       /*!< the input of CLA2SIGS0 is CLAIN0(PA15) */
#define CLA3SIGS0_CLAIN2                 CLA_SIGS0(8)                       /*!< the input of CLA3SIGS0 is CLAIN2(PB4) */

#define CLA0SIGS0_CLAIN2                 CLA_SIGS0(9)                       /*!< the input of CLA0SIGS0 is CLAIN2(PB4) */
#define CLA1SIGS0_CLAIN5                 CLA_SIGS0(9)                       /*!< the input of CLA1SIGS0 is CLAIN5(PB7) */
#define CLA2SIGS0_CLAIN1                 CLA_SIGS0(9)                       /*!< the input of CLA2SIGS0 is CLAIN1(PB3) */
#define CLA3SIGS0_CLAIN3                 CLA_SIGS0(9)                       /*!< the input of CLA3SIGS0 is CLAIN3(PB5) */

#define CLA0SIGS0_CLAIN4                 CLA_SIGS0(10)                      /*!< the input of CLA0SIGS0 is CLAIN4(PB6) */
#define CLA1SIGS0_CLAIN8                 CLA_SIGS0(10)                      /*!< the input of CLA1SIGS0 is CLAIN8(PB0) */
#define CLA2SIGS0_CLAIN8                 CLA_SIGS0(10)                      /*!< the input of CLA2SIGS0 is CLAIN8(PB0) */
#define CLA3SIGS0_CLAIN6                 CLA_SIGS0(10)                      /*!< the input of CLA3SIGS0 is CLAIN6(PB8) */

#define CLA0SIGS0_CLAIN6                 CLA_SIGS0(11)                      /*!< the input of CLA0SIGS0 is CLAIN6(PB8) */
#define CLA1SIGS0_CLAIN10                CLA_SIGS0(11)                      /*!< the input of CLA1SIGS0 is CLAIN10(PB2) */
#define CLA2SIGS0_CLAIN9                 CLA_SIGS0(11)                      /*!< the input of CLA2SIGS0 is CLAIN9(PB1) */
#define CLA3SIGS0_CLAIN7                 CLA_SIGS0(11)                      /*!< the input of CLA3SIGS0 is CLAIN7(PB9) */

#define CLA0SIGS0_CLAIN8                 CLA_SIGS0(12)                      /*!< the input of CLA0SIGS0 is CLAIN8(PB0) */
#define CLA1SIGS0_CLAIN12                CLA_SIGS0(12)                      /*!< the input of CLA1SIGS0 is CLAIN12(PA9) */
#define CLA2SIGS0_CLAIN14                CLA_SIGS0(12)                      /*!< the input of CLA2SIGS0 is CLAIN14(PA11) */
#define CLA3SIGS0_CLAIN10                CLA_SIGS0(12)                      /*!< the input of CLA3SIGS0 is CLAIN10(PB2) */

#define CLA0SIGS0_CLAIN10                CLA_SIGS0(13)                      /*!< the input of CLA0SIGS0 is CLAIN10(PB2) */
#define CLA1SIGS0_CLAIN13                CLA_SIGS0(13)                      /*!< the input of CLA1SIGS0 is CLAIN13(PA10) */
#define CLA2SIGS0_CLAIN15                CLA_SIGS0(13)                      /*!< the input of CLA2SIGS0 is CLAIN15(PA12) */
#define CLA3SIGS0_CLAIN11                CLA_SIGS0(13)                      /*!< the input of CLA3SIGS0 is CLAIN11(PA8) */

