wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_cla.h
#define CLA0SIGS0_CLAIN12                CLA_SIGS0(14)                      /*!< the input of CLA0SIGS0 is CLAIN12(PA9) */
#define CLA1SIGS0_CLAIN16                CLA_SIGS0(14)                      /*!< the input of CLA1SIGS0 is CLAIN16(PF0) */
#define CLA2SIGS0_CLAIN16                CLA_SIGS0(14)                      /*!< the input of CLA2SIGS0 is CLAIN16(PF0) */
#define CLA3SIGS0_CLAIN18                CLA_SIGS0(14)                      /*!< the input of CLA3SIGS0 is CLAIN18(PA0) */

#define CLA0SIGS0_CLAIN14                CLA_SIGS0(15)                      /*!< the input of CLA0SIGS0 is CLAIN14(PA11) */
#define CLA1SIGS0_CLAIN18                CLA_SIGS0(15)                      /*!< the input of CLA1SIGS0 is CLAIN18(PA0) */
#define CLA2SIGS0_CLAIN17                CLA_SIGS0(15)                      /*!< the input of CLA2SIGS0 is CLAIN17(PF1) */
#define CLA3SIGS0_CLAIN19                CLA_SIGS0(15)                      /*!< the input of CLA3SIGS0 is CLAIN19(PA1) */

/* SIGS1 input selection */
#define CLA_SIGS1(regval)                (BITS(0,3) & ((uint32_t)(regval) << 0U))
#define CLA0SIGS1_CLA0_ASYNC_OUT         CLA_SIGS1(0)                       /*!< the input of CLA0SIGS1 is CLA0_ASYNC_OUT */
#define CLA1SIGS1_CLA0_ASYNC_OUT         CLA_SIGS1(0)                       /*!< the input of CLA1SIGS1 is CLA0_ASYNC_OUT */
#define CLA2SIGS1_CLA0_ASYNC_OUT         CLA_SIGS1(0)                       /*!< the input of CLA2SIGS1 is CLA0_ASYNC_OUT */
#define CLA3SIGS1_CLA0_ASYNC_OUT         CLA_SIGS1(0)                       /*!< the input of CLA3SIGS1 is CLA0_ASYNC_OUT */

#define CLA0SIGS1_CLA1_ASYNC_OUT         CLA_SIGS1(1)                       /*!< the input of CLA0SIGS1 is CLA1_ASYNC_OUT */
#define CLA1SIGS1_CLA1_ASYNC_OUT         CLA_SIGS1(1)                       /*!< the input of CLA1SIGS1 is CLA1_ASYNC_OUT */
#define CLA2SIGS1_CLA1_ASYNC_OUT         CLA_SIGS1(1)                       /*!< the input of CLA2SIGS1 is CLA1_ASYNC_OUT */
#define CLA3SIGS1_CLA1_ASYNC_OUT         CLA_SIGS1(1)                       /*!< the input of CLA3SIGS1 is CLA1_ASYNC_OUT */

#define CLA0SIGS1_CLA2_ASYNC_OUT         CLA_SIGS1(2)                       /*!< the input of CLA0SIGS1 is CLA2_ASYNC_OUT */
#define CLA1SIGS1_CLA2_ASYNC_OUT         CLA_SIGS1(2)                       /*!< the input of CLA1SIGS1 is CLA2_ASYNC_OUT */
#define CLA2SIGS1_CLA2_ASYNC_OUT         CLA_SIGS1(2)                       /*!< the input of CLA2SIGS1 is CLA2_ASYNC_OUT */
#define CLA3SIGS1_CLA2_ASYNC_OUT         CLA_SIGS1(2)                       /*!< the input of CLA3SIGS1 is CLA2_ASYNC_OUT */

#define CLA0SIGS1_CLA3_ASYNC_OUT         CLA_SIGS1(3)                       /*!< the input of CLA0SIGS1 is CLA3_ASYNC_OUT */
#define CLA1SIGS1_CLA3_ASYNC_OUT         CLA_SIGS1(3)                       /*!< the input of CLA1SIGS1 is CLA3_ASYNC_OUT */
#define CLA2SIGS1_CLA3_ASYNC_OUT         CLA_SIGS1(3)                       /*!< the input of CLA2SIGS1 is CLA3_ASYNC_OUT */
#define CLA3SIGS1_CLA3_ASYNC_OUT         CLA_SIGS1(3)                       /*!< the input of CLA3SIGS1 is CLA3_ASYNC_OUT */

#define CLA0SIGS1_TRIGSEL_CLA_IN11       CLA_SIGS1(4)                       /*!< the input of CLA0SIGS1 is TRIGSEL_CLA_IN11 */
#define CLA1SIGS1_TRIGSEL_CLA_IN11       CLA_SIGS1(4)                       /*!< the input of CLA1SIGS1 is TRIGSEL_CLA_IN11 */
#define CLA2SIGS1_TRIGSEL_CLA_IN11       CLA_SIGS1(4)                       /*!< the input of CLA2SIGS1 is TRIGSEL_CLA_IN11 */
#define CLA3SIGS1_TRIGSEL_CLA_IN11       CLA_SIGS1(4)                       /*!< the input of CLA3SIGS1 is TRIGSEL_CLA_IN11 */

#define CLA0SIGS1_TRIGSEL_CLA_IN3        CLA_SIGS1(5)                       /*!< the input of CLA0SIGS1 is TRIGSEL_CLA_IN3 */
#define CLA1SIGS1_TRIGSEL_CLA_IN1        CLA_SIGS1(5)                       /*!< the input of CLA1SIGS1 is TRIGSEL_CLA_IN1 */
#define CLA2SIGS1_TRIGSEL_CLA_IN0        CLA_SIGS1(5)                       /*!< the input of CLA2SIGS1 is TRIGSEL_CLA_IN0 */
#define CLA3SIGS1_TRIGSEL_CLA_IN0        CLA_SIGS1(5)                       /*!< the input of CLA3SIGS1 is TRIGSEL_CLA_IN0 */

#define CLA0SIGS1_TRIGSEL_CLA_IN4        CLA_SIGS1(6)                       /*!< the input of CLA0SIGS1 is TRIGSEL_CLA_IN4 */
#define CLA1SIGS1_TRIGSEL_CLA_IN2        CLA_SIGS1(6)                       /*!< the input of CLA1SIGS1 is TRIGSEL_CLA_IN2 */
#define CLA2SIGS1_TRIGSEL_CLA_IN2        CLA_SIGS1(6)                       /*!< the input of CLA2SIGS1 is TRIGSEL_CLA_IN2 */
#define CLA3SIGS1_TRIGSEL_CLA_IN1        CLA_SIGS1(6)                       /*!< the input of CLA3SIGS1 is TRIGSEL_CLA_IN1 */

#define CLA0SIGS1_TRIGSEL_CLA_IN5        CLA_SIGS1(7)                       /*!< the input of CLA0SIGS1 is TRIGSEL_CLA_IN5 */
#define CLA1SIGS1_TRIGSEL_CLA_IN5        CLA_SIGS1(7)                       /*!< the input of CLA1SIGS1 is TRIGSEL_CLA_IN5 */
#define CLA2SIGS1_TRIGSEL_CLA_IN4        CLA_SIGS1(7)                       /*!< the input of CLA2SIGS1 is TRIGSEL_CLA_IN4 */
#define CLA3SIGS1_TRIGSEL_CLA_IN3        CLA_SIGS1(7)                       /*!< the input of CLA3SIGS1 is TRIGSEL_CLA_IN3 */

#define CLA0SIGS1_CLAIN1                 CLA_SIGS1(8)                       /*!< the input of CLA0SIGS1 is CLAIN1(PB3) */
#define CLA1SIGS1_CLAIN6                 CLA_SIGS1(8)                       /*!< the input of CLA1SIGS1 is CLAIN6(PB8) */
#define CLA2SIGS1_CLAIN2                 CLA_SIGS1(8)                       /*!< the input of CLA2SIGS1 is CLAIN2(PB4) */
#define CLA3SIGS1_CLAIN0                 CLA_SIGS1(8)                       /*!< the input of CLA3SIGS1 is CLAIN0(PA15) */

#define CLA0SIGS1_CLAIN3                 CLA_SIGS1(9)                       /*!< the input of CLA0SIGS1 is CLAIN3(PB5) */
#define CLA1SIGS1_CLAIN7                 CLA_SIGS1(9)                       /*!< the input of CLA1SIGS1 is CLAIN7(PB9) */
#define CLA2SIGS1_CLAIN3                 CLA_SIGS1(9)                       /*!< the input of CLA2SIGS1 is CLAIN3(PB5) */
#define CLA3SIGS1_CLAIN1                 CLA_SIGS1(9)                       /*!< the input of CLA3SIGS1 is CLAIN1(PB3) */

